In [1]:
# Задание 1
# Создайте numpy array с элементами от числа N до 0 (например, для N = 10 это будет array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])).

In [8]:
import numpy as np
x = np.arange(9,-1,-1)
print(x)

[9 8 7 6 5 4 3 2 1 0]

In [9]:
# Задание 2
# Создайте диагональную матрицу с элементами от N до 0. Посчитайте сумму ее значений на диагонали.

In [15]:
matrix = np.diag(np.arange(9,-1,-1))
print(sum(matrix.diagonal()))

45

In [16]:
# Задание 3
# Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
# Определите какому фильму было выставлено больше всего оценок 5.0.

In [17]:
import pandas as pd

In [20]:
movies = pd.read_csv('ml-latest-small/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [21]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [42]:
ratings[ratings['rating'] == 5].groupby('movieId').count().sort_values('rating', ascending=False).head(1)

         userId  rating  timestamp
movieId
318         153     153        153

In [53]:
movies[movies['movieId'] == ratings[ratings['rating'] == 5]['movieId'].value_counts().head(1).keys()[0]]

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

In [54]:
# Задание 4
# По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) 
# категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [59]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [67]:
power[((power.category == 4) | (power.category == 12) | (power.category == 21)) 
     & (power.year >= 2005) & (power.year <= 2010) 
     & (power.quantity > 0)
     & ((power.country == 'Latvia') | (power.country == 'Lithuania') | (power.country == 'Estonia'))].quantity.sum()

240580.0

In [68]:
# Задание 5
# Решите систему уравнений:
# 4x + 2y + z = 4
# x + 3y = 12
# 5y + 4z = -3

In [69]:
from numpy import linalg

In [70]:
a = np.array([[4,2,1],[1,3,0],[0,5,4]])
b = np.array([4,12,-3])
x = linalg.solve(a,b)
print(x)

[ 0.46666667  3.84444444 -5.55555556]

In [71]:
# верно?
np.allclose( np.dot(a, linalg.solve(a, b)), b )

True